tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "go-swagger/go-swagger"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "synack/docker"
brew "ack"
brew "aria2"
brew "augeas"
brew "autojump"
brew "aws-keychain"
brew "awscli"
brew "bash-completion"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "dialog"
brew "git"
brew "docker-machine"
brew "dos2unix"
brew "findutils"
brew "freetype"
brew "fontconfig"
brew "fzf"
brew "gmp"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "jpeg"
brew "gd"
brew "gettext"
brew "git-extras"
brew "go"
brew "glide"
brew "gnu-sed", args: ["with-default-names"]
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "godep"
brew "pth"
brew "gpg-agent"
brew "libtool"
brew "graphviz"
brew "pcre"
brew "grep"
brew "openssl"
brew "xz"
brew "python3"
brew "httpie"
brew "hub"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "libevent"
brew "libidn"
brew "python"
brew "libyaml"
brew "mackup"
brew "mas"
brew "md5sha1sum"
brew "mobile-shell"
brew "node"
brew "pkg-config"
brew "rclone"
brew "reattach-to-user-namespace"
brew "redis"
brew "rsync"
brew "ruby"
brew "screen"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "ttyrec"
brew "utf8proc"
brew "wget"
brew "wrk"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "synack/docker/docker-rsync"
cask "alfred"
cask "android-platform-tools"
cask "android-sdk"
cask "anki"
cask "atom"
cask "beyond-compare"
cask "caffeine"
cask "cleanmymac"
cask "dash"
cask "diffmerge"
cask "dropbox"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-hack"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "genymotion"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpgtools"
cask "iterm2"
cask "java"
cask "kindle"
cask "lastfm"
cask "lastpass"
cask "ngrok"
cask "osxfuse"
cask "parallels-desktop"
cask "postgres"
cask "screenflow"
cask "sizeup"
cask "skitch"
cask "skype"
cask "slack"
cask "staruml"
cask "telegram"
cask "the-unarchiver"
cask "thinkorswim"
cask "utorrent"
cask "viber"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "Microsoft Remote Desktop", id: 715768417
mas "Motorbike Lite", id: 529135494
mas "Samurai vs. Zombies", id: 543342490
mas "Todoist", id: 585829637
mas "Toy Defense 2", id: 709170059
mas "Wire", id: 931134707
mas "Xcode", id: 497799835
