brew_args appdir: "/Applications"

# Taps
tap 'homebrew/brew-fonts'
tap 'homebrew/bundle'

brew 'ag'
brew 'aria2'
brew 'aws-vault'
brew 'awscli'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'dos2unix'
brew 'duti'
brew 'findutils'
brew 'fzf'
brew 'gcc'
brew 'git-extras'
brew 'git'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'md5sha1sum'
brew 'mobile-shell'
brew 'node'
brew 'openssl'
brew 'pass'
brew 'python'
brew 'rclone'
brew 'rename'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'screen'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'ttyrec'
brew 'vim', args: ["with-override-system-vi"]
brew 'wget', args: ["--with-iri"]
brew 'wrk'
brew 'thefuck'
brew 'yarn'
brew 'yt-dlp'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps
brew 'alfred'
brew 'anki'
brew 'beyond-compare'
brew 'caffeine'
brew 'dash'
brew 'diffmerge'
brew 'dropbox'
brew 'iterm2'
brew 'kindle'
brew '1password'
brew 'ngrok'
brew 'postgres'
brew 'sizeup'
brew 'skitch'
brew 'slack'
brew 'spotify'
brew 'telegram'
brew 'the-unarchiver'
brew 'visual-studio-code'
brew 'vlc'

# Fonts
brew 'font-awesome-terminal-fonts'
brew 'font-hack'
brew 'font-inconsolata-dz-for-powerline'
brew 'font-inconsolata-for-powerline'
brew 'font-inconsolata-g-for-powerline'
brew 'font-roboto-mono-for-powerline'
brew 'font-roboto-mono'
brew 'font-source-code-pro'
brew 'font-source-sans-pro'
brew 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Todoist', id: 585829637
