cask_args appdir: "/Applications"

# Taps
tap 'caskroom/fonts'
tap 'homebrew/bundle'

brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'ag'
brew 'aria2'
brew 'aws-keychain'
brew 'awscli'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'dos2unix'
brew 'findutils'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-extras'
brew 'glide'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gpg-agent'
brew 'grep'
brew 'screen'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'lastpass-cli'
brew 'md5sha1sum'
brew 'mobile-shell'
brew 'node'
brew 'openssl'
brew 'python'
brew 'rclone'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'ttyrec'
brew 'vim', args: ["with-override-system-vi"]
brew 'wget'
brew 'wrk'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

# Apps
cask 'alfred'
cask 'android-platform-tools'
cask 'anki'
cask 'atom'
cask 'beyond-compare'
cask 'caffeine'
cask 'cleanmymac'
cask 'dash'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
cask 'font-awesome-terminal-fonts'
cask 'font-hack'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'gpgtools'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'lastfm'
cask 'lastpass'
cask 'ngrok'
cask 'osxfuse'
cask 'postgres'
cask 'screenflow'
cask 'sizeup'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'staruml'
cask 'telegram'
cask 'the-unarchiver'
cask 'thinkorswim'
cask 'utorrent'
cask 'viber'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-awesome-terminal-fonts'
cask 'font-hack'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro'

# Install Mac App Store apps
mas 'Todoist', id: 585829637

