# Taps
tap 'homebrew/brew-fonts'
tap 'homebrew/bundle'

brew 'ag'
brew 'aria2'
brew 'aws-vault'
brew 'awscli'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'dos2unix'
brew 'duti'
brew 'findutils'
brew 'fzf'
brew 'gcc'
brew 'git-extras'
brew 'git'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'md5sha1sum'
brew 'mobile-shell'
brew 'node'
brew 'openssl'
brew 'pass'
brew 'python'
brew 'rclone'
brew 'rename'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'screen'
brew 'skaffold'
brew 'ssh-copy-id'
brew 'datawire/blackbird/telepresence'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'ttyrec'
brew 'vim'
brew 'wget'
brew 'wrk'
brew 'thefuck'
brew 'yarn'
brew 'yt-dlp'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Apps
cask 'alfred'
cask 'anki'
cask 'baretorrent'
cask 'beyond-compare'
cask 'caffeine'
cask 'clipy'
cask 'conduktor/brew/conduktor'
cask 'dash'
cask 'diffmerge'
cask 'dropbox'
cask 'iterm2'
cask 'kindle'
cask '1password'
cask 'ngrok'
cask 'sizeup'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-awesome-terminal-fonts'
cask 'font-hack'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Todoist', id: 585829637
